# ============================================================
# Lola Stories — Co-founder Bootstrap Brewfile
# Run: brew bundle install --file=Brewfile
# ============================================================

# ── Taps ────────────────────────────────────────────────────
tap "infisical/get-cli"

# ── Core CLI ────────────────────────────────────────────────
brew "bat"
brew "curl"
brew "fzf"
brew "gettext"          # provides envsubst
brew "gh"
brew "git"
brew "jq"
brew "ripgrep"
brew "tmux"
brew "tree"

# ── Languages & runtimes ────────────────────────────────────
brew "node"
brew "nvm"
brew "pnpm"
brew "python@3.13"
brew "uv"

# ── Containers & databases ──────────────────────────────────
brew "colima"
brew "docker"
brew "docker-compose"
brew "postgresql@17"
brew "redis"

# ── Networking & dev utilities ──────────────────────────────
brew "mkcert"
brew "infisical/get-cli/infisical"

# ── Shell: zsh plugins + prompt ─────────────────────────────
brew "starship"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-history-substring-search"

# ── Casks: Essential ────────────────────────────────────────
cask "1password"
cask "1password-cli"
cask "google-chrome"
cask "raycast"

# ── Casks: Development ──────────────────────────────────────
cask "bruno"
cask "claude"
cask "cursor"
cask "dbeaver-community"
cask "github"
cask "ngrok"
cask "visual-studio-code"

# ── Casks: Communication & productivity ─────────────────────
cask "chatgpt"
cask "discord"
cask "notion"
cask "obsidian"
cask "slack"
